<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html lang="sv">
<head>
<!--Copyright (C) 1996-1997 by Mikael Bonnier, Lund, Sweden.-->
  <meta content="text/html; charset=utf-8" http-equiv="content-type">
  <title>Hj&auml;lp f&ouml;r Statiskop</title>
  <meta content="Mikael O. Bonnier mikael.bonnier@gmail.com" name="author">
</head>
<body style="background-color: rgb(192, 192, 192);" vlink="#800080">
<!-- counter-ord-lang -->
<p><a href="help-sv.html"><img src="https://mobluse.github.io/pocketcalc/sve1.gif" alt="[Svenska]"
 name="sve" align="right" border="0" height="28" width="31"></a><a
 href="help.html"><img src="https://mobluse.github.io/pocketcalc/enu1.gif" alt="[English]"
 name="enu" align="right" border="0" height="28" width="31"></a></p>
<h2>Statiskop</h2>
<p>
</p>
<hr>
<h3>Hj&auml;lp f&ouml;r Statiscope 1.0beta8 <a
 href="index-sv.html">applet</a>
och applikation</h3>
<dl>
  <dt><b>Kom i g&aring;ng</b></dt>
  <dd>Vid textrutorna i n&auml;rheten av <b>Simulate</b>-knappen, mata
in 170 i <b>Number</b>-rutan, 90 i <b>Mean</b>-rutan och 30 i <b>Std.
dev.</b>-rutan. Klicka p&aring; <b>Simulate</b>-knappen. Klicka igenom
radioknapparna <b>Distribute</b>, <b>Probability mass</b>, osv.
Klicka p&aring; knappen <b>Sort</b> f&ouml;r att sortera och sedan
p&aring; <b>Clear data</b> f&ouml;r att t&ouml;mma listan. <b>Stop</b>-knappen
anv&auml;nds f&ouml;r att avbryta l&aring;nga operationer.</dd>
  <dt><a name="dataentry"></a><b>Datainmatning</b></dt>
  <dd>Mata in ett tal i textrutan <b>Data/Location</b> och tryck
p&aring; Enter. Forts&auml;tt att mata in ytterligare n&aring;gra tal.
Decimaltal kr&auml;ver punkt enligt amerikansk standard. (En svensk
version kommer, men man kan diskutera hur svensk den skall vara.) Man
kan mata in flera tal samtidigt &aring;tskilda av komma (alternativt
semikolon eller mellanslag).<br>
Prova t ex denna lista: 5, 3.5, 9, 3.5<br>
Du kan markera den och kopiera den med Ctrl+C i Windows (Cmd+C i
Macintosh, markera endast i X-windows), klicka i <b>Data/Location</b>-rutan
och klistra sedan in urklippet med Ctrl+V i Windows (Cmd+V i Macintosh,
musens mittknapp i X-windows) och tryck p&aring; Enter. Detta &auml;r
tyv&auml;rr den enda metod man kan anv&auml;nda f&ouml;r att kopiera
och klistra i en Java applet.<br>
    <br>
Det &auml;r m&ouml;jligt att radera tal i listan genom att klicka
p&aring; dem och trycka p&aring; Delete eller Backspace p&aring;
tangentbordet. Man kan &auml;ven skjuta in tal i listan genom att
klicka d&auml;r man vill att det nya talet skall l&auml;ggas in och
trycka p&aring; tangent I. (Insert hade varit att f&ouml;redra men det
fungerar tyv&auml;rr inte i Java.) N&auml;r man st&aring;r i listan kan
man g&aring; upp och ner med upp- och nerpiltangenterna, men detta
fungerar ocks&aring; n&auml;r man st&aring;r i textrutan <b>Data/Location</b>.
Om man redigerar ett v&auml;rde och trycker p&aring; Enter s&aring;
uppdateras v&auml;rdet. F&ouml;r att l&auml;gga till nya v&auml;rden
m&aring;ste man st&auml;lla sig l&auml;ngst ner i listan.<br>
    <br>
I applikationen kan du anv&auml;nda dig av funktionerna i <b>File</b>-menyn.
    <b>Open</b> l&aring;ter dig v&auml;lja den fil som ska laddas. <b>Save</b>
anv&auml;nds f&ouml;r att spara data till en fil.<br>
    <br>
En annan metod att f&aring; in data i programmet &auml;r att skriva en
URL i <b>Data/Location</b>-rutan. Du kan &ouml;ppna en ny browser och
ta upp sidan:<br>
    <a href="http://www.maths.lth.se/matstat/datalib/" target="_blank">http://www.maths.lth.se/matstat/datalib/</a><br>
(Klicka p&aring; l&auml;nken s&aring; &ouml;ppnas ett nytt
browser-f&ouml;nster automatiskt.)<br>
Klicka s&aring; att du f&aring;r upp foton.dat, kopiera URL:en
fr&aring;n browsern och klistra in i Statiskops <b>Data/Location</b>-ruta
och tryck p&aring; Enter. Nu kommer den f&ouml;rsta kolumnen l&auml;sas
in i programmet. Vill man ange en annan kolumn m&aring;ste man skriva
URL:en komma kolumnnumret.<br>
T ex http://www.maths.lth.se/matstat/datalib/foton.dat,2 l&auml;ser in
andra kolumnen.<br>
    <br>
En speciell l&auml;nk kan anv&auml;ndas f&ouml;r att f&aring;
Statiscope att ladda dina data automatiskt. Detta f&ouml;rklaras
p&aring; <a href="urlencoder-sv.html"><b>Statiscope ULR-kodare</b></a>
sidan.<br>
    <br>
Den sista metoden, simulering, har redan beskrivits vid "Kom i
g&aring;ng". Simuleringen ger normalf&ouml;rdelade v&auml;rden.</dd>
  <dt><b>Statistiska grafer</b></dt>
  <dd>Genom att klicka p&aring; radioknapparna till v&auml;nster visas
motsvarande statistiska graf. Det finns dels riktiga grafer och dels
textdiagram. Skalorna ber&auml;knas automatisk, men skalstrecken
p&aring; x-axeln kan p&aring;verkas genom att trycka p&aring; &lt; och
&gt; knapparna. Avst&aring;ndet mellan skalstrecken &auml;r alltid 1, 2
eller 5 g&aring;nger en tiopotens. Om kryssrutan Rel. &auml;r ikryssad
visas motsvarande relativa funktion ist&auml;llet f&ouml;r den
absoluta. Om kryssrutan Theo. &auml;r ikryssad visas dessutom
motsvarande teoretiska funktion baserad p&aring;
normalf&ouml;rdelningen med samma medelv&auml;rde och standardavvikelse
som m&auml;tdatat.</dd>
  <dt><b>Distribution</b></dt>
  <dd>Denna visar den empiriska f&ouml;rdelningsfunktionen, dvs
h&ouml;jden p&aring; grafen motsvarar sannolikheten f&ouml;r att ett
m&auml;tv&auml;rde skall vara mindre &auml;n eller lika med ett visst
x-v&auml;rde. Den b&ouml;rjar i 0 och slutar i 1.</dd>
  <dt><b>Probability mass</b></dt>
  <dd>Denna visar massfunktionen, dvs antalet datapunkter med ett visst
x-v&auml;rde. Om Rel. &auml;r ikryssad &auml;r det i st&auml;llet
sannolikheten f&ouml;r m&auml;tv&auml;rdet. Detta &auml;r ett
stolpdiagram.</dd>
  <dt><b>Density</b></dt>
  <dd>Denna visar t&auml;thetsfunktionen, dvs antalet datapunkter som
faller inom de olika intervallen som x-axeln &auml;r indelad i. Om Rel.
&auml;r ikryssad visas i st&auml;llet sannolikheten f&ouml;r att hamna
inom intervallet. Detta &auml;r ett histogram.</dd>
  <dt><b>Box plot</b></dt>
  <dd>Denna visar ett l&aring;dagram &ouml;ver datat. De vertikala
strecken i l&aring;dagrammet motsvarar - fr&aring;n v&auml;nster -
minimum, 1:a kvartil, median (eller 2:a kvartil), 3:e kvartil och
maximum. Denna graf sammanfattar f&ouml;rdelningen.</dd>
  <dt><b>Stem and leaf</b></dt>
  <dd>Denna visar ett stam och l&ouml;v diagram &ouml;ver datat. Det
visar ett sorts liggande histogram. Det &auml;r b&auml;st l&auml;mpat
f&ouml;r positiva heltal d&aring; skillnaden mellan maximum och minimum
h&ouml;gst &auml;r under n&aring;got hundra. F&ouml;rst&aring;s enklast
med ett exempel.</dd>
  <dt><b>Data listing</b></dt>
  <dd>Detta &auml;r katten bland hermelinerna. Den visar helt enkelt
samma data som i listan. Syftet med detta &auml;r att man kan kopiera
data fr&aring;n denna utskrift och klistra in den i en editor, f&ouml;r
att kanske slutligen publicera sina data p&aring; n&auml;tet. Tipsa
g&auml;rna mig om Statiscope kompatibla data.</dd>
  <dt><b>Number</b></dt>
  <dd>Antalet datapunkter.</dd>
  <dt><b>Sum</b></dt>
  <dd>Summan av datapunkterna.</dd>
  <dt><b>Mean</b></dt>
  <dd>Medelv&auml;rdet, eller empiriskt v&auml;ntev&auml;rde, dvs
summan av datapunkterna delat med antalet datapunkter.</dd>
  <dt><b>Sam. std. dev.</b></dt>
  <dd>Stickprovsstandardavvikelsen, detta &auml;r det m&aring;tt
p&aring; spridningen av datat som oftast anv&auml;nds. Speciellt
n&auml;r datat &auml;r ett stickprov tagit fr&aring;n en st&ouml;rre
eller o&auml;ndlig population. Den &auml;r roten av summan av
kvadraterna p&aring; skillnaderna mellan datapunkterna och
medelv&auml;rdet delat med antalet datapunkter minus ett.</dd>
  <dt><b>Pop. std. dev.</b></dt>
  <dd>Populationsstandardavvikelsen, anv&auml;nds om datat &auml;r
samlat fr&aring;n hela populationen. Anv&auml;nds s&auml;llan i
praktiken. Den &auml;r roten av summan av kvadraterna p&aring;
skillnaderna mellan datapunkterna och medelv&auml;rdet delat med
antalet datapunkter.</dd>
  <dt><b>Minimum</b></dt>
  <dd>Den minsta av datapunkterna.</dd>
  <dt><b>Quartile 1</b></dt>
  <dd>Medianen av datapunkterna mellan det minsta v&auml;rdet och
medianen av alla datapunkterna.</dd>
  <dt><b>Median</b></dt>
  <dd>Medianen, dvs om man sorterar datat &auml;r detta det mittersta i
listan eller medelv&auml;rdet av de tv&aring; mittersta, beroende
p&aring; om antalet &auml;r udda respektive j&auml;mnt.</dd>
  <dt><b>Quartile 3</b></dt>
  <dd>Medianen av datapunkterna mellan medianen av alla datapunkterna
och det st&ouml;rsta v&auml;rdet.</dd>
  <dt><b>Maximum</b></dt>
  <dd>Det st&ouml;rsta v&auml;rdet.</dd>
  <dt><b>Konfidensintervall och hypotespr&ouml;vning</b></dt>
  <dd>Konfidensintervallens procentsats p&aring;verkar endast
konfidensintervallen och inte hypotespr&ouml;vningarna. Men
radioknapparna <b>Lower</b>, <b>Middle</b>, och <b>Upper</b>
p&aring;verkar b&aring;de konfidensintervallen och
hypotespr&ouml;vningarna.<br>
[t- och Chi-2-f&ouml;rdelningar anv&auml;nds. Algoritmerna f&ouml;r
Chi-2 beh&ouml;ver nog f&ouml;rb&auml;ttras.]</dd>
  <dt><b>Konfidensintervall</b></dt>
  <dd>Konfidensintervall i allm&auml;nhet betyder att sannolikheten att
det verkliga v&auml;rdet skall hamna inom intervallet &auml;r lika med
procentsatsen vid <b>Confidence</b> (t ex 95%).<br>
    <b>Mean</b> &auml;r konfidensintervallet f&ouml;r
v&auml;ntev&auml;rdet, och <b>Std. dev.</b> &auml;r
konfidensintervallet f&ouml;r standardavvikelsen. Man kan best&auml;mma
undre, tv&aring;-sidigt och &ouml;vre konfidensintervall, genom att
v&auml;lja <b>Lower</b>, <b>Middle</b> respektive <b>Upper</b>.</dd>
  <dt><b>Hypotespr&ouml;vning</b></dt>
  <dd>Med hypotespr&ouml;vning kan man unders&ouml;ka om en viss
hypotes skall accepteras eller f&ouml;rkastas. Om mothypotesen
anv&auml;nds som ny hypotes och f&ouml;rkastas &auml;r den f&ouml;rra
hypotesen statistiskt bevisad.<br>
Hypotesen betecknas H<sub>0</sub> och mothypotesen betecknas H<sub>1</sub>.
    <pre>Om<br>  H<sub>0</sub>: verkligt v&auml;rde &lt;= hypotes,  H<sub>1</sub>: verkligt v&auml;rde &gt; hypotes,<br>anv&auml;nd <b>Lower</b>.<br>Om<br>  H<sub>0</sub>: verkligt v&auml;rde = hypotes,   H<sub>1</sub>: verkligt v&auml;rde &lt;&gt; hypotes,<br>anv&auml;nd <b>Middle</b>.<br>Om<br>  H<sub>0</sub>: verkligt v&auml;rde &gt;= hypotes,  H<sub>1</sub>: verkligt v&auml;rde &lt; hypotes,<br>anv&auml;nd <b>Upper</b>.<br>   </pre>
    <p>Hypotesen f&ouml;rkastas om p-v&auml;rdet understiger en viss
p&aring; f&ouml;rhand best&auml;md niv&aring; t ex 0.05. Ju h&ouml;gre
niv&aring; desto striktare test. Hypoteserna skrivs in i rutorna under <b>Hypothesis</b>
och p-v&auml;rdet visas i rutorna under <b>P-value</b>.</p>
  </dd>
  <dt><b>R&auml;tt browser</b></dt>
  <dd>F&ouml;r appletten rekommenderas Netscape Navigator 3.01,
tidigare versioner har haft problem med bl a listans beteende. Om vissa
kontroller inte ritas upp kan du prova att minimera browsern och sen ta
upp den igen. En alternativ l&auml;sare &auml;r Microsoft Internet
Explorer 3.0.</dd>
  <dt><b>Synpunkter</b></dt>
  <dd>Felrapporter och f&ouml;rslag till f&ouml;rb&auml;ttringar
p&aring; programmet Statiscope och denna dokumentation tas tacksamt
emot av <a href="../rendezvous/rendezvous-sve.cgi">Mikael Bonnier</a>.</dd>
  <dt><b>DISCLAIMER</b></dt>
  <dd>THIS PROGRAM IS USED AT YOUR OWN RISK. IT SHOULD SPECIFICALLY NOT
BE USED IN HIGH RISK ACTIVITY SUCH AS DIAGNOSIS AND TREATMENT OF
PATIENTS, OR THE OPERATION OF NUCLEAR FACILITIES OR WEAPONS SYSTEMS.</dd>
</dl>
<p><b>The program Statiscope and this documentation is Copyright
&copy; 1996-1997 by Mikael Bonnier, Lund, Sweden. All rights
reserved.</b></p>
<address>WWW hemsida: <a href="http://www.df.lth.se/%7Emikaelb/"
 target="_top">http://www.df.lth.se/~mikaelb/</a></address>
<p>
</p>
<hr>
<table align="right" border="1">
  <tbody>
    <tr>
      <td bgcolor="#808080">
      <p><!--a href="http://hem.passagen.se/orbinweb/" target="links"--><font
 face="Arial,Helvetica"><b>Orbin</b></font><!--/a--><br>
      <font face="Arial,Helvetica" size="-2">Web Technology</font></p>
      </td>
    </tr>
  </tbody>
</table>
</body>
</html>
